Revit 2027 API
DocumentSet.Insert Method
Insert the specified item into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	Document item
)
Public Overridable Function Insert (
	item As Document
) As Boolean
public:
virtual bool Insert(
	Document^ item
)
abstract Insert :
        item : Document -> bool
override Insert :
        item : Document -> bool
Parameters
item Document
The item to be inserted into the set.
Return Value
Boolean
Returns whether the item was inserted into the set.
See Also
Reference
DocumentSet Class
Autodesk.Revit.DB Namespace